{
  "General Windows 10/11 Management": {
    "How do you check the Windows version on a PC?": "Press Win + R to open the Run dialog. Type winver and press Enter. A window will appear showing the version and build number of Windows.",
    "How do you update Windows 10/11 to the latest version?": "Open Settings by pressing Win + I. Navigate to Update & Security > Windows Update. Click Check for updates. If updates are available, click Download and install. Restart your computer if prompted to complete the installation.",
    "How do you create a local user account in Windows 10/11?": "Open Settings and go to Accounts. Click on Family & other users in the left-hand menu. Under Other users, click Add someone else to this PC. Choose I don’t have this person’s sign-in information, then select Add a user without a Microsoft account. Enter a username, password, and password hint, then click Next to create the account.",
    "How do you manage startup programs in Windows 10/11?": "Press Ctrl + Shift + Esc to open Task Manager. Go to the Startup tab. Right-click any program you want to disable from starting automatically, and select Disable. To enable a program, right-click and select Enable.",
    "How do you use Task Manager to monitor system performance?": "Open Task Manager by pressing Ctrl + Shift + Esc. Click on the Performance tab. Here, you can view real-time graphs and statistics for CPU, memory, disk, network, and GPU usage. Click on each category to see detailed performance data.",
    "How do you change the display resolution in Windows 10/11?": "Right-click on the desktop and select Display settings. Scroll down to the Display resolution section. Use the dropdown menu to select your desired resolution. Click Apply and then confirm the change if the screen looks correct.",
    "How do you configure power settings in Windows 10/11?": "Open Settings and go to System > Power & sleep. Adjust the screen and sleep settings to your preference. For advanced settings, click Additional power settings under Related settings. In the Power Options window, select a power plan or customize your own.",
    "How do you set up a new printer in Windows 10/11?": "Open Settings and go to Devices > Printers & scanners. Click Add a printer or scanner. Windows will search for available printers. Select your printer and click Add device. If the printer isn’t found, click The printer that I want isn’t listed and follow the wizard to add it manually.",
    "How do you manage disk partitions in Windows 10/11?": "Right-click on the Start button and select Disk Management. In the Disk Management window, right-click a partition and choose the action you want to perform (e.g., Shrink Volume, Extend Volume, Delete Volume). Follow the on-screen prompts to complete the action.",
    "How do you back up files using File History in Windows 10/11?": "Open Settings and go to Update & Security > Backup. Click Add a drive under Back up using File History. Select an external drive or network location for the backup. Once added, File History will automatically back up your files to the selected drive. You can configure which folders are backed up and how often the backup runs."
  },
  "Networking": {
    "How do you configure a static IP address in Windows 10/11?": "Open Settings and go to Network & Internet. Click Change adapter options under the Status section. Right-click your network connection and select Properties. Select Internet Protocol Version 4 (TCP/IPv4) and click Properties. Choose Use the following IP address and enter your IP address, subnet mask, and default gateway. Enter the preferred and alternate DNS server addresses, then click OK.",
    "How do you troubleshoot network connectivity issues in Windows 10/11?": "Open Settings and go to Network & Internet > Status. Scroll down and click Network troubleshooter. Follow the on-screen instructions to diagnose and fix network issues. You can also use the ipconfig /all and ping commands in Command Prompt to gather more information and test connectivity.",
    "How do you set up a VPN connection in Windows 10/11?": "Open Settings and go to Network & Internet > VPN. Click Add a VPN connection. Fill in the VPN provider, connection name, server name or address, VPN type, and sign-in information. Click Save and then connect to the VPN using the connection you just created.",
    "How do you share files and folders over a network in Windows 10/11?": "Right-click on the folder you want to share and select Properties. Go to the Sharing tab and click Share. Choose the users or groups you want to share the folder with and set their permissions. Click Share, then Done. Users on the same network can now access the shared folder.",
    "How do you connect to a Wi-Fi network in Windows 10/11?": "Click on the network icon in the taskbar. Select the Wi-Fi network you want to connect to. Click Connect and enter the Wi-Fi password. Once connected, you can choose whether to make the network public or private.",
    "How do you reset network settings in Windows 10/11?": "Open Settings and go to Network & Internet > Status. Scroll down and click Network reset. Click Reset now and confirm. Your PC will restart, and all network adapters will be reset to their default settings.",
    "How do you view and manage network adapters in Windows 10/11?": "Right-click the Start button and select Device Manager. Expand the Network adapters section to view all installed network adapters. Right-click a network adapter to update its driver, disable it, or view its properties.",
    "How do you map a network drive in Windows 10/11?": "Open File Explorer and click This PC in the left-hand menu. Click Map network drive on the toolbar. Choose a drive letter and enter the network path (e.g., \\\\server\\folder). Check Reconnect at sign-in if you want the drive to be mapped automatically each time you log in. Click Finish to map the drive.",
    "How do you configure a proxy server in Windows 10/11?": "Open Settings and go to Network & Internet > Proxy. Under Manual proxy setup, toggle Use a proxy server to On. Enter the proxy server address and port number. If needed, specify addresses that should bypass the proxy. Click Save to apply the settings.",
    "How do you troubleshoot Wi-Fi connectivity issues in Windows 10/11?": "Ensure that Wi-Fi is enabled on your device by checking the Wi-Fi icon in the taskbar. Open Settings and go to Network & Internet > Status, then click Network troubleshooter. If the troubleshooter doesn’t resolve the issue, try restarting your router and computer. Use the ipconfig /release and ipconfig /renew commands in Command Prompt to refresh your IP address. Ensure that you are within range of the Wi-Fi network and that the correct password is entered."
  },
  "Security": {
    "How do you enable Windows Defender Antivirus in Windows 10/11?": "Open Settings and go to Update & Security > Windows Security. Click Virus & threat protection. Under Virus & threat protection settings, click Manage settings. Toggle Real-time protection to On.",
    "How do you configure BitLocker to encrypt a drive in Windows 10/11?": "Open Control Panel and go to System and Security > BitLocker Drive Encryption. Click Turn on BitLocker next to the drive you want to encrypt. Choose how you want to unlock the drive (e.g., password, USB key). Choose where to back up your recovery key. Choose whether to encrypt only used space or the entire drive. Click Start Encrypting to begin the encryption process.",
    "How do you set up Windows Hello for facial recognition in Windows 10/11?": "Open Settings and go to Accounts > Sign-in options. Under Windows Hello Face, click Set up. Follow the on-screen instructions to capture your facial data. Once set up, you can use facial recognition to sign in to your device.",
    "How do you enable and configure a firewall in Windows 10/11?": "Open Control Panel and go to System and Security > Windows Defender Firewall. Click Turn Windows Defender Firewall on or off in the left-hand menu. Select Turn on Windows Defender Firewall for both private and public networks. Click OK to apply the settings. To configure specific rules, click Advanced settings in the left-hand menu.",
    "How do you manage user account control (UAC) settings in Windows 10/11?": "Open Control Panel and go to System and Security > Security and Maintenance. Click Change User Account Control settings in the left-hand menu. Move the slider to the desired level of notification. Click OK to apply the settings.",
    "How do you set up two-factor authentication (2FA) on a Windows 10/11 account?": "Go to the Microsoft account security website: https://account.microsoft.com/security. Sign in with your Microsoft account credentials. Under Security, click Advanced security options. Find Two-step verification and click Turn on. Follow the prompts to set up two-factor authentication using your preferred method (e.g., phone, email, authenticator app).",
    "How do you create a system restore point in Windows 10/11?": "Open Control Panel and go to System and Security > System. Click System protection in the left-hand menu. Under Protection Settings, select the drive where Windows is installed, then click Configure. Select Turn on system protection and click OK. Click Create, enter a description, and click Create again to create a restore point.",
    "How do you enable controlled folder access in Windows 10/11?": "Open Settings and go to Update & Security > Windows Security. Click Virus & threat protection. Under Ransomware protection, click Manage ransomware protection. Toggle Controlled folder access to On. Click Protected folders to add any additional folders you want to protect.",
    "How do you manage Windows Update settings in Windows 10/11?": "Open Settings and go to Update & Security > Windows Update. Click Advanced options to customize update settings, such as update notifications, active hours, and delivery optimization. You can also pause updates temporarily by clicking Pause updates for 7 days.",
    "How do you clear browsing data in Microsoft Edge on Windows 10/11?": "Open Microsoft Edge and click on the three-dot menu in the upper-right corner. Select Settings, then go to Privacy, search, and services. Under Clear browsing data, click Choose what to clear. Select the types of data you want to remove (e.g., browsing history, cookies, cached images). Click Clear now to delete the selected data."
  },
  "Virtualization and Advanced Management": {
    "How do you enable Hyper-V in Windows 10/11?": "Open Control Panel and go to Programs > Turn Windows features on or off. Scroll down and check the box next to Hyper-V. Click OK and allow Windows to install the necessary components. Restart your computer when prompted. After restarting, you can open the Hyper-V Manager from the Start menu.",
    "How do you create and configure a virtual machine in Hyper-V?": "Open Hyper-V Manager from the Start menu. Click New in the Actions pane and select Virtual Machine. Follow the wizard to specify the VM name, location, and generation. Assign memory, configure network settings, and attach a virtual hard disk. Choose to install an operating system from an ISO file or physical media. Click Finish to create the VM, then start it and complete the OS installation.",
    "How do you create a system image backup in Windows 10/11?": "Open Control Panel and go to System and Security > Backup and Restore (Windows 7). Click Create a system image in the left-hand menu. Choose a location to save the backup (e.g., an external drive or network location). Select the drives you want to include in the backup. Click Start backup to create the system image.",
    "How do you use Windows Sandbox in Windows 10/11?": "Ensure that Windows Sandbox is enabled by going to Control Panel > Programs > Turn Windows features on or off and checking Windows Sandbox. Open Windows Sandbox from the Start menu. Use the sandbox environment to safely test applications or browse the web without affecting your main system. When you close Windows Sandbox, all data and applications within it are discarded.",
    "How do you enable and use Remote Desktop in Windows 10/11?": "Open Settings and go to System > Remote Desktop. Toggle Enable Remote Desktop to On. Note the PC name, which you'll need to connect remotely. On the remote computer, open the Remote Desktop Connection app (mstsc). Enter the PC name and click Connect. Enter your credentials when prompted to access the remote desktop.",
    "How do you manage virtual desktops in Windows 10/11?": "Press Win + Tab to open Task View. Click New desktop to create a new virtual desktop. You can switch between desktops by pressing Ctrl + Win + Left/Right Arrow. To move a window to another desktop, right-click the window in Task View and choose Move to, then select the desired desktop.",
    "How do you use Storage Spaces in Windows 10/11?": "Open Control Panel and go to System and Security > Storage Spaces. Click Create a new pool and storage space. Select the drives you want to use and click Create pool. Choose a name, drive letter, and resilience type (Simple, Mirror, or Parity). Specify the storage size and click Create storage space.",
    "How do you configure ReadyBoost in Windows 10/11?": "Insert a USB flash drive into your computer. Open File Explorer, right-click the USB drive, and select Properties. Go to the ReadyBoost tab. Select Use this device and choose how much space to allocate for ReadyBoost. Click Apply and OK.",
    "How do you configure Windows Subsystem for Linux (WSL) in Windows 10/11?": "Open Control Panel and go to Programs > Turn Windows features on or off. Check Windows Subsystem for Linux and click OK. Restart your computer if prompted. Open the Microsoft Store and search for your preferred Linux distribution (e.g., Ubuntu). Install the distribution and launch it from the Start menu to set up WSL.",
    "How do you enable Dynamic Lock in Windows 10/11?": "Pair your Bluetooth device (e.g., phone) with your computer. Open Settings and go to Accounts > Sign-in options. Scroll down to the Dynamic lock section. Check the box next to Allow Windows to automatically lock your device when you’re away. Windows will automatically lock your device when the paired Bluetooth device is out of range."
  },
  "Troubleshooting": {
    "How do you troubleshoot a slow Windows 10/11 PC?": "Open Task Manager by pressing Ctrl + Shift + Esc. Check the Processes tab for any applications or processes using a high percentage of CPU, memory, or disk. Close unnecessary applications or processes by right-clicking them and selecting End task. Run Disk Cleanup to remove temporary files and free up space. Check for malware by running a full scan with Windows Defender or another antivirus program. Disable startup programs that you don’t need by going to Task Manager > Startup tab. Consider upgrading your hardware (e.g., add more RAM or switch to an SSD) if the PC remains slow.",
    "How do you fix Windows Update errors in Windows 10/11?": "Open Settings and go to Update & Security > Windows Update. Click Troubleshoot, then select Additional troubleshooters. Run the Windows Update troubleshooter and follow the on-screen instructions. If the issue persists, try resetting Windows Update components by running the following commands in Command Prompt (as Administrator): net stop wuauserv, net stop bits, net stop cryptsvc, ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old, ren C:\\Windows\\System32\\catroot2 catroot2.old, net start wuauserv, net start bits, net start cryptsvc. Restart your computer and check for updates again.",
    "How do you fix a “Blue Screen of Death” (BSOD) in Windows 10/11?": "Note the stop code displayed on the BSOD, as it can help identify the cause. If you recently installed new hardware or drivers, try removing or rolling back the changes. Boot into Safe Mode by pressing Shift + F8 during startup and selecting Safe Mode. Use the Event Viewer to check for errors that occurred just before the BSOD. Run a memory test using the Windows Memory Diagnostic tool. If the issue persists, perform a system restore to revert to a previous stable state.",
    "How do you fix a computer that won’t start in Windows 10/11?": "Check that all cables are securely connected and that the power supply is functioning. If the computer starts but can’t boot into Windows, try booting into Safe Mode. Use Startup Repair from the Windows Recovery Environment (WinRE) by selecting Repair your computer > Troubleshoot > Advanced options > Startup Repair. If you suspect a hardware issue, remove non-essential peripherals and see if the computer starts. If the problem persists, consider performing a system restore or reinstalling Windows.",
    "How do you fix app crashes or freezes in Windows 10/11?": "Ensure the app is up to date by checking for updates in the Microsoft Store or the app’s own update mechanism. Run the app as an administrator by right-clicking its shortcut and selecting Run as administrator. Use the Compatibility Troubleshooter by right-clicking the app’s shortcut, selecting Properties, and going to the Compatibility tab. If the app continues to crash, try reinstalling it. Check the Event Viewer for error logs related to the app crashes.",
    "How do you troubleshoot audio issues in Windows 10/11?": "Right-click the speaker icon in the taskbar and select Troubleshoot sound problems. Follow the troubleshooter’s recommendations. Ensure that the correct playback device is selected by right-clicking the speaker icon and choosing Open Sound settings. Check the Device Manager for any driver issues under Sound, video, and game controllers. If necessary, update or reinstall the audio drivers.",
    "How do you troubleshoot network printer issues in Windows 10/11?": "Ensure that the printer is powered on and connected to the network. Run the printer troubleshooter by going to Settings > Devices > Printers & scanners, selecting the printer, and clicking Troubleshoot. Verify that the printer is set as the default printer. Check the Print Spooler service by typing services.msc in the Run dialog, finding Print Spooler, and ensuring it’s running. If the issue persists, remove and re-add the printer in Printers & scanners.",
    "How do you fix Windows activation issues in Windows 10/11?": "Go to Settings > Update & Security > Activation. Click Troubleshoot if Windows isn’t activated. If the troubleshooter doesn’t resolve the issue, ensure that you’re using a valid product key. Use the slmgr.vbs /dli command in Command Prompt (as Administrator) to display the current activation status. If necessary, re-enter your product key by clicking Change product key in the Activation settings.",
    "How do you fix a black screen after login in Windows 10/11?": "Press Ctrl + Shift + Esc to open Task Manager. Check if explorer.exe is running. If not, click File > Run new task, type explorer.exe, and press Enter. Update your display drivers by going to Device Manager, expanding Display adapters, right-clicking the adapter, and selecting Update driver. Disable fast startup by going to Control Panel > Power Options > Choose what the power buttons do, and unchecking Turn on fast startup. If the problem persists, boot into Safe Mode and uninstall any recent updates or drivers.",
    "How do you reset your PC in Windows 10/11?": "Open Settings and go to Update & Security > Recovery. Under Reset this PC, click Get started. Choose either Keep my files or Remove everything, depending on whether you want to preserve your personal files. Follow the on-screen instructions to reset your PC. Your PC will restart and begin the reset process, which may take some time."
  }
}
